{
  "recipe": [
    {
      "id": 1,
      "name": "Baked Ziti",
      "ingredients": "For the meat sauce 3 pounds ground chuck 3 cloves garlic,  1 large onion chopped 1 tablespoon basil1 tablespoon oregano 1 tablespoon salt 1 12-ounce can tomato paste 12 ounces water To assemble lasagna Mozzarella and provolone cheese 6 lasagna noodles",
      "instructions":" For the meat sauce In a heavy skillet, slowly brown ground chuck. Spoon off fat. Add remaining ingredients. Simmer one hour, stirring occasionally.For the cheese filling: Mix together cottage cheese paramesan, cheese parsley and eggs. To assemble lasagna: Preheat oven to 350 F. Cook lasagna noodles according to package directions. Drain. Grease a 9-by-13-inch baking dish. Place half the cooked noodles in baking dish. Spread with half the cheese filling and layer with sliced provolone cheese.Add half the meat sauce.Repeat layers topping with mozzarella to cover entirely. Top with sliced pepperoni. Bake for 1 hour. Let stand 10 minutes before serving.",
      "image": "https://www.jocooks.com/wp-content/uploads/2019/05/baked-ziti-1-15-768x576.jpg",
      "upvotes": 44,
      "downvotes":5,
      "calories": 540
    },

    {
      "id":2,
      "name":"Baked Ziti",
      "ingredients": "1/2 lb Italian sausage 16 ounces ziti  2 28 ounce cans crushed tomatoes2 TBS tomato paste  1/2 cup merlot optional 1 bell pepper finely diced 1 onion finely diced2 garlic cloves minced  1 tsp granulated sugar 3 fresh basil leaves chiffonade 1 TBS oregano  1 tsp fennel seeds 15 oz ricotta cheese 2 cups mozzarella cheese shredded  1 cup parmesan cheese shredded or grated Salt and pepper to taste",
     "instructions":"Preheat oven to 375°F Brown ground beef and sausage  Drain off the fat Add in the onions, bell peppers and garlic and stir for 3 mins.Pour in the merlot.Simmer for 2 minutes. Add the crushed tomatoes, tomato paste, sugar, oregano, fennel seeds, and half of the basil.Salt and pepper to tasteStir, reduce the heat to low, and simmer for 1 1/2 hours.Prepare ziti according to package instructionsDrain and mix with the sauce. Spray a 9×13 baking dish or lasagna pan with nonstick cooking spray.Pour half of the ziti and sauce mixture into the pan.Add half of the ricotta on top of the pasta and spread it out evenly.In a separate bowl, toss the mozzarella and parmesan together. Sprinkle half of the cheese mixture on top of the pasta. Pour in the rest of the pasta/sauce mixThen, add the rest of the ricotta in dollops. Sprinkle the remain cheese on top evenly.Bake, uncovered, for 40 minutes.Garnish with the remaining chiffonade basil. Allow it to cool for at least 20 minutes before serving.",
      "image":"https://i1.wp.com/coopcancook.com/wp-content/uploads/2021/09/bmc_5336.jpg?resize=1536%2C1077&ssl=1",
      "upvotes": 88,
      "downvotes":5,
      "calories": 579
    },

    {
      "id":3,
      "name": "Guacamole",
      "ingredients":"2 large ripe avocados 1/4 cup onion diced 1 tsp garlic minced 1 jalapeño diced 2 TBS fresh cilantro finely chopped  Juice from 1/2 of a lime 2 Roma tomatoes seeded and diced  Kosher salt to taste",
      "instructions":"Using a Molcajete In a molcajete bowl, add in half of the onions, half of the jalapeños, half of the cilantro, all of the garlic, and 1/2 tsp of salt.Use the pestle to grind the ingredients into a paste. Cut, peel, and pit the avocados and add them into the molcajete bowl. Smash the avocado with the pestle, combining it with the paste until the desired consistency is reached. Be sure to leave chunks of avocado. Add in the rest of the onions, jalapeños, cilantro, tomatoes, and lime juice.Gently fold everything together.Taste and add more salt as needed. Using a regular mixing bowlCut, peel, and pit the avocados and add them to your bowl.Use a fork to smash up the avocados to your desired consistency.  Add all remaining ingredients and stir gently to combine.Salt to taste.",
      "image":"https://i0.wp.com/coopcancook.com/wp-content/uploads/2021/06/bmc_3780.jpg?resize=480%2C640&ssl=1",
      "upvotes": 10,
      "downvotes":2,
      "calories": 430
      
    },

    {
      "id":4,
      "name":"Chicken Pot Pie",
      "ingredients": "9-inch pie crusts 3 T butter 1/3 cup chopped onions 1 chopped celery stalk 1 tsp minced garlic 3 T all purpose flour 1 1/2 cups chicken stock or broth 1 T onion powder 1 T garlic powder1 tsp Italian seasoning 1/2 cup heavy cream 2 cup cooked, shredded chicken 12 oz pkg frozen peas and carrots1 egg 1 tsp water salt and pepper to taste",
      "instructions": "Preheat oven to 400 degrees F  Melt butter in a saucepan Saute onions and celery in the butter until translucent; about 5 mins  Add garlic and saute for 1 min.Sprinkle in flour and stir for 2 mins to cook out flour tastePour in the chicken stock and add in Italian seasoning, onion, & garlic powders Simmer for 5 minsStir in the heavy cream Salt and pepper to tasteCook until mixture thickens Turn off the heatAdd in the chicken, peas, and carrots  Roll out one pie crust to 1 cm thickness and add it to the bottom of a greased, 9 inch pie plate Pour filling into the pie dish on top of the crustRoll out the other crust and top the filling. Press to seal the edges Whisk egg and water together and brush the top of the crust with it.Cut several slits in the top of the pie to vent  Bake for 30-35 mins or until golden brownAllow 10 mins to cool before serving",
      "image":"https://i2.wp.com/coopcancook.com/wp-content/uploads/2018/01/cppig.jpg?w=2280&ssl=1",
      "upvotes": 22,
      "downvotes":4,
      "calories":800
    },

    {
      "id":5,
      "name":"Shrimp Creole",
      "ingredients":"2-3 lbs 21-30 count shrimp 2 tsp liquid crab boil 1 T olive oil4 T butter 1/2 cup diced onion1 diced bell pepper 2 diced celery stalks 2 tsp minced garlic 2 T all purpose flour* 1/2 cup dry white wine 1 1/2 cup shrimp stock 28 oz tomato sauce*2 tsp Worcestershire sauce 14.5 oz can petit diced tomatoes drained2 bay leaves1 tsp thyme leaves 2 tsp granulated sugar1 T onion powder 1 T garlic powder Creole seasoning to tasteparsley or green onions to garnish",
      "instructions":"Heat olive oil in a heavy bottom pot or Dutch ovenAdd in onions, bell peppers, and celerySaute until translucent Add in the minced garlic and saute for 30 secs.Sprinkle in flour and stir for 1 min  Pour in the wine and stock Simmer for 5 mins Add in all remaining ingredients except for the shrimp, liquid crab boil, and Creole seasoning Stir, cover, and simmer on low for 30 mins  Season to taste Toss the shrimp in the crab boil and add them into the pot Stir until the shrimp are pink and fully cooked; about 5 minsServe over warm rice and garnish with green onions or parsley",
      "image":"https://i2.wp.com/coopcancook.com/wp-content/uploads/2018/05/creig.jpg?w=2280&ssl=1",
      "upvotes": 55,
      "downvotes":9,
      "calories":865
    }, 

    {
      "id":6,
      "name":"Baked Mac And Cheese",
      "ingredients":"1 or 1 1/2 pounds elbow macaroni4 qt chicken broth2 TBS butter12 oz can evaporated milk1 cup half and half 1 tsp onion powder 2 tsp salt2 tsp white pepper 1 cup shredded American cheese 1/2 cup shredded Colby Jack cheese 1 cup shredded Mozzarella cheese1 cup shredded Muenster cheese1/2 cup shredded Cheddar cheese",
      "instructions":"Preheat oven to 375 F Pour broth in a large pot  Bring to a boil Stir in the elbow macaroni and cook according to package instructions until al dente. Drain macaroni. Do NOT rinse. Pour macaroni back into the pot; heat offStir in the butter until it melts Pour in the evaporated milk and half and half. Turn heat back on medium.  Bring mixture to a simmer Add in the salt, onion powder, and white pepper.Stir in all of the American cheese and half of the rest of the cheeses EXCEPT the cheddar cheese. Once cheese melts, turn off the heat.Butter a 9×13* baking dish.Pour the macaroni into the dish in a single layer. Add the remaining cheese on top including the cheddar cheese.Bake for 30-35 or until the cheese is as brown on top as you’d like.Allow it to rest for 10 minutes.",
      "image":"https://i2.wp.com/coopcancook.com/wp-content/uploads/2019/10/Photo-Sep-02-1-05-55-PM.jpg?w=1815&ssl=1",
      "upvotes": 30,
      "downvotes":4,
      "calories": 1200
    },

    {
      "id":7,
      "name":"Cajun Shrimp Alfredo",
      "ingredients":"1 lb raw large shrimp Don’t use those baby, salad shrimp in my dang recipe! 3/4 of a 16oz pkg of Fettuccine pasta cooked** 2 tsp Cajun seasoning1 tsp onion powder 1 tsp garlic powder 1 tsp Herbes de Provence or Italian seasoning  1 tsp paprika 1/2 tsp lemon pepper 1 TBS olive oil  2 TBS butter  1 tsp minced garlic 1/3 cup white wine I use Chardonnay or chicken broth 2 cups heavy whipping cream 2/3 cup grated Parmesan cheese Salt and pepper to tasteFresh parsley to garnis",
      "instructions":"Season the shrimp with the onion powder, garlic powder, Herbes de Provence or Italian seasoning, lemon pepper, paprika, and 1 tsp of the Cajun seasoning. In a pan, heat the olive oil over medium high heat Add in the shrimp and cook until they are pink.  Remove the shrimp and tint with foil to keep warm Add the butter to the same pan. Once it melts, add in the garlic and sauté for 30 secs Pour in the wine and stir to deglaze the panAfter the wine reduces, pour in the heavy cream.Bring it to a simmer.Add in the Parmesan cheese and the other tsp of Cajun seasoningTurn the heat to low and allow the sauce to simmer for 5-6 mins. Taste and adjusting seasoning as needed Add the cooked pasta and shrimp to the sauce and toss well to coat.Garnish with fresh parsley",
      "image":"https://i2.wp.com/coopcancook.com/wp-content/uploads/2019/01/Photo-Jan-17-1-53-40-PM.jpg?w=2280&ssl=1",
      "upvotes": 30,
      "downvotes": 15,
      "calories":1200
    }],

  "skinny": [
    {
      "id":8,
      "name":"Crawfish Balls",
      "ingredients":"1 lb frozen crawfish tails thawed 1/2 stick unsalted butter 1/3 cup finely diced onion1/3 cup finely diced bell pepper 2 stalks diced celery1 TBS crushed garlic1/4 cup chopped green onions 2 cups Italian style breadcrumbs 1 TBS liquid crab and shrimp boil 2 TBS Cajun or creole seasoning 1 tsp onion powder 2 eggs 1/4 cup milk 2 cups all purpose flourOil for frying",
      "instructions":"After thawing, drain the fat off of the crawfish; reserve the fat. Roughly chop the crawfish; set aside.Melt butter in a pan. Add in the onions, bell pepper, celery, and garlic.Sauté for 2-3 minutesAdd in the crawfish fat, liquid crab boil, 1 TBS Cajun/creole seasoning, and onion powder. Stir and simmer for 3 minutes.Add in the crawfish tails and stir until crawfish are warm; about 2 minutes. Do not overcook.Turn off the heat and remove the pan from the stove. Stir in 1 cup of the breadcrumbs and all of the green onions into the mixture.Allow the mixture to cool to room temperature.Create a breading station by whisking the egg and milk in a bowl. Next, pour the flour in one shallow dish and mix 1 TBS of Cajun seasoning into the flour. Add the remaining 1 cup of breadcrumbs into another shallow dish. When the crawfish mixture has cooled, form it into 1 inch balls. Heat oil to 350°F for frying. Dredge each ball into the flour, then the egg wash, and finally into the breadcrumbs.Fry the balls for 3 mins or until golden brown. Drain on a wired rack.",
        "image":"https://i0.wp.com/coopcancook.com/wp-content/uploads/2016/05/bmc_4523.jpg?resize=1536%2C1024&ssl=1",
        "upvotes": 100,
        "downvotes":20,
        "calories":400
    },

    {
      "id":9,
      "name":"Spring Chicken Tray With Green Vegetables",
      "ingredients": "2 peppers, deseeded and roughly chopped.2 medium-sized sweet potatoes, cut into 2cm pieces1 red onion, finely chopped. 2 courgettes, roughly chopped. 2tbsp extra virgin olive oil, plus extra to brush. 200g mushrooms, roughly chopped. 250g pack ready-to-eat puy lentils. 3tbsp green olive tapenade. Small handful of fresh parsley or oregano, roughly chopped,5 filo pastry sheets, each measuring about 32 x 38cm",
      "instructions":"Heat the oven to 200°C or Gas Mark 6. Put the peppers, sweet potato, onion and courgettes in a large roasting tin. Toss through the oil and season well. Roast the vegetables in the oven for 15 mins, turning them to coat. Add the mushrooms and cook for 15 mins more. Set aside to cool completely. Rinse the lentils and stir through the tapenade and parsley or oregano. Check the seasoning and gently mix with the roasted vegetables. Heat the oven to 200°C or Gas Mark 6. Brush one side of each sheet of filo pastry with oil then arrange, oil-side down, in the springform tin, leaving no gaps at the base or sides let the excess filo hang over the edges.Spoon the vegetable filling into the pastry and press down firmly to level. Cover the filling with the overhanging pastry, scrunching it up. Bake the pie in the oven for 20 mins, then unclip and remove the metal rim. Bake for 10-15 mins more, until deep golden.",
      "image":"https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/63/2017/04/vegetarian-filo-pie-scaled.jpg",
      "upvotes": 136,
      "downvotes": 0,
      "calories":303

    },

    {
      "id": 10,
      "name":"spring chciken tray bake with green vegatables",
      "ingredients":"2 tbsp olive oil, 6 small skin-on chicken thighs, 150ml chicken stock,6 spring onions,100g Tenderstem broccoli,100 sugar snaps, 1 lemon quartered, small handful oregano, 500g new potatoes to serve",
      "instructions":"Heat the oven to 180C, gas 4. Heat the oil in a flameproof and ovenproof dish on the hob until hot. Carefully add  the chicken thighs, skin side down, and cook for 4-5 minutes until golden and crisp.Remove from the hob and carefully pour over the stock and place in the oven for 15 minutes.Remove the chicken from the oven and add the vegetables and lemon quarters to the pan, making sure to coat them in the stock, and season well. Return to the oven for 10 minutes, until the chicken is cooked through and the vegetables are just tender. Scatter with oregano and serve with new potatoes.",
      "image":"https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/63/2016/05/spring-chicken-traybake-1024x647.jpg",
      "upvotes": 200,
      "downvotes": 5,
      "Calories":270

    },
    {
      "id": 11,
      "name":"Wholewheat Spaghetti with Roasted Veg",
      "ingredients":" 4 baby aubergines,2 courgettes, sliced 4tbsp olive oil,500g wholewheat spaghetti,Zest and juice 2 lemons,1⁄2 x 30g packet basil,1⁄2 x 30g packet mint",
      "instructions":"Heat the oven to 200C, gas 6. Toss the veg in 2tbsp olive oil and put onto a lined baking tray. Roast for 10-15    mins until just crisp. Remove from the oven and allow to cool. Meanwhile, cook the spaghetti according to pack instructions. Drain well, then toss with the remaining olive oil, the lemon juice, roasted vegetables and most of the basil and mint.Pour onto a serving platter and scatter over lemon zest and the remaining herbs to serve.",
      "image":"https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/63/2018/07/Wholewheat-spaghetti-with-roasted-veg-scaled.jpg",
      "upvotes": 30,
      "downvotes": 2,
      "calories": 379
    },
    {
      "is": 12,
      "name":"Lemon chicken and rice stir fry",
      "ingrediants":"200g chicken, cut into small strips, 1tbsp sunflower oil,200g cooked rice pouch,100g frozen peas,100g sugar snaps,100g sweetcorn or baby corn chopped,1-2 spring onions,chopped 1tbsp sesame seeds",
      "instructions":"Put all the marinade ingredients into a non-metallic bowl and add the chicken. Leave to marinate, until ready to cook.Add the oil to a wok or deep frying pan and fry the chicken. Reserve the marinade. Stir-fry for 3-4 mins, then add the veg and stir-fry for a further 2-3 mins.Add the rice and the reserved marinade, along with 2-3tbsp water and stir-fry until piping hot. Toss the spring onion through the rice and serve sprinkled with the sesame seeds.",
      "image":"https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/63/2018/07/Lemon-chicken-and-rice-stir-fry-scaled.jpg",
      "upvotes": 34,
      "downvotes": 23,
      "calories":216
    },
    {
      "id": 13,
      "name":"Spicy-Pepper-Pulled-Pork",
      "ingredients":"5kg boneless pork shoulder.1 pack Bart Smokehouse Barbecue Chipotle Rub.1tsp coarse black pepper,1tbsp oil,8tbsp ketchup, 4tbsp cider vinegar,2tbsp Worcestershire sauce,1tbsp honey",
      "instructions":"Heat the oven to 220C, gas 7. Rub the pork skin with the chipotle mix, black pepper and oil. Put the pork onto a rack in a roasting tin and roast for 1 hr.Meanwhile, mix together the ketchup, vinegar, Worcestershire sauce and honey.Skim off any fat from the roasting pan juices and remove the crackling from the pork, then set aside. Pour the ketchup mixture around the pork and cover the tin with foil. Turn the oven down to 150C, gas 3 and continue to cook for 4hrs, or cook on a BBQ for an extra smoky flavour.Put the cooked pork on a board and using two forks, shred the meat into small pieces. Stir the shredded meat back into the cooking juices, which should have reduced to a sauce.Serve the meat piled into baked sweet potatoes or burger buns with crackling, coleslaw and a rocket salad, garnished with sliced chilli and some spring onion",
      "image":"https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/63/2015/07/pulled-pork-scaled.jpg",
      "upvotes": 9,
      "downvotes": 1,
      "calories":465
    },
    {
      "id":14,
      "name": "Moroccan-Chicken-Salad",
      "ingredients":"2 chicken breasts, about 150g each.4tsps olive oil,2tsps harissa paste, 6 baby courgettes, each sliced into 3 pieces lengthways,4 slices of ciabatta,2 handfuls of watercress,180g packet griddled artichokes in oil,16 green olives,1tbsp balsamic vinegar,Handful of garlic chives, optional",
      "instructions":"Put the chicken breasts between 2 sheets of cling film and bash with a rolling pin until the meat is about 1cm thick.Rub 2tsps of oil over the chicken, then the harissa paste. Heat a griddle pan until very hot. Rub the rest of the oil over the courgette slices and grill until tender.Wipe any excess paste off the chicken and grill the breasts for 3-4 minutes on each side. Take out of the pan and wrap in foil. Griddle the slices of ciabatta.Divide the watercress, chunks of ciabatta, courgettes, artichokes and olives between 4 plates. Slice the chicken and arrange on top. Whisk 3tbsps of oil from the pack of artichokes with the balsamic vinegar and drizzle over the salad. Scatter with garlic chives, if you like.",
      "image":"https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/63/2019/06/Moroccan-chicken-salad.jpg",
      "upvotes": 55,
      "downvotes": 1,
      "calories":236
    },
    {
      "id":15,
      "name":"Meatballs-with-lemon-tagliatelle",
      "ingredients":" 25-250g 7½-8oz veal, pork or turkey mince 1 lemon ½ tsp herbes de provence, optional Salt and freshly ground black pepper 2 tsp vegetable oil 150g 5oz tagliatelle 1 courgette.Knob of butter.Pinch of dried chilli flakes, optional.2-3 tbs crème fraîche or half-fat crème fraîche",
      "instructions":"Put the mince into a large bowl and grate in zest from half the lemon and add the herbs, if using, and season well. Heat the oil in a pan and add small portions of meat about 14, roughly clumped together, and cook them over a med heat, without moving them in the pan for 5 mins. Flip them over and cook for another couple of mins, or until browned all over. Tip them out into an ovenproof dish and keep them warm in the oven on a low temperature. Meanwhile, add the pasta to a pan of boiling water and cook for 6 mins.Cut the ends off the courgette and use a vegetable peeler to pare it into ribbons around the core.Heat the butter in the frying pan, add the courgette ribbons, along with the chilli flakes, if using, and sauté for a few minutes until softened. Drain the pasta, reserving a little water in the pan, put the pasta back in the pan and mix in the crème fraîche and the rest of the lemon zest and juice, to taste. Stir in the courgette ribbons and meatballs. Serve hot.",
      "image":"https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/63/2018/07/Lemony-tagliatelle-with-meatballs-scaled.jpg",
      "upvotes": 20,
      "downvotes": 5,
      "calories":"350"
    }
  ]
}

	
    
	
	

